<head>

    <meta charset="utf-8">
    <title>Таблица</title>
    <style type="text/css">
        TABLE {
            width: 800px;
            border-collapse: collapse;
        }
        TD, TH {
            padding: 3px;
            border: 1px solid black;
        }
        TH {
            background: #b0e0e6; /* Цвет фона */
        }
    </style>
</head>


<?php
    require('baze.php');
    echo '<h1>Холодильник</h1> ';
    $a=array();

    $a[0] = array("Холодильник","Рецепты",'Калории,состав,витамины','Список покупок','Питание цели');
    $a[1] = array("+ Добавить","Графиком/Таблицей",'Сортировка,группировка','Настройки');
echo "<table><tr><td><a href ='#'>".$a[0][0]."</a></td><td> <a href ='#'>".$a[0][1]."</a></td><td> <a href ='#'>".$a[0][2]."</a></td><td> <a href ='#'>".$a[0][3]."</a></td> </tr>";
echo "<tr><td><a href ='#'>".$a[1][0]."</a></td><td> <a href ='#'>".$a[1][1]."</a></td><td> <a href ='#'>".$a[1][2]."</a></td><td> <a href ='#'>".$a[1][3]."</a></td> </tr>";
echo  "</table> <p><a href ='#'>Мясо Свинина 500гр с.г.18.09</a> <a href ='#'>Сыр 200гр с.г.09.09</a> <a href ='#'>Помидоры 330гр с.г.18.10</a> <a href ='#'>Картошка 1500гр с.г.8.09</a>  </p>";
echo  "<p><a href ='#'>Мясо Курица</a> <a href ='#'>Лук 200гр с.г.28.09</a> <a href ='#'>Колбоса 440гр с.г.01.11</a> <a href ='#'>Молоко</a> </p>";

echo "____________________________________________________________________________<br>";
echo "<h1>Рецепты</h1>";
echo "<table><tr><td><a href ='#'>".$a[0][0]."</a></td><td> <a href ='#'>".$a[0][1]."</a></td><td> <a href ='#'>".$a[0][2]."</a></td><td> <a href ='#'>".$a[0][3]."</a></td> </tr>
</table>";
echo '<a href ="#">Попродуктам</a> <a href ="#">Мои</a> <a href ="#">популярные</a> <a href ="#">Новые</a> <a href ="#">для здоровье по программе</a><br>';
echo  " <table><th><td> порция 2+-^ </td><td> продукты+-^ </td><td>тип Основное</td><td>   полезность+-</td><td>  время+-</td><td>  стоимость+-</td><td>*(добавить убрать Пункты/Рекомендуется к нему</td> </th>
<tr><td>500гр+-</td><td>мясо по французки</td> <td> мясо  ✓ помидоры  ✓ (+добавить в список покупок) лук × мойнез+- ✓</td><td>Основное</td><td>66%</td><td>15мин</td><td>300р</td><td>Салат греческий+</td></tr>
<tr><td>200гр</td><td>салат гречески <td> мясо  ✓ помидоры (+добавить в список покупок) лук  ✓ мойнез+-  ✓</td><td>Салат</td><td>86%</td><td>20мин</td><td>40р</td><td>Картошка по фр+, кампот+</td></tr>
<tr><td>400гр</td><td>шарлотка с ягодами</td> <td> мясо ✓ помидоры (+добавить в список покупок) лук ✓ мойнез+- ✓</td><td>Десерт</td><td>32%</td><td>40мин</td><td>160р</td><td>кампот+</td></tr>
<tr><td>800гр</td><td>Тортильи с курицейи овощами</td> <td> мясо ✓ помидоры (+добавить в список покупок) лук ✓ мойнез+- ✓</td><td>Основное</td><td>26%</td><td>60мин</td><td>240р</td><td>столовое вино+</td></tr>
</table>

<a href=''#'>легкое</a>, белковое, по вашей программе, романтический ужин, быстрое дешевое, (теги поиск)
<br>
v0.01
";



?>

